<?php
use yii\helpers\Markdown;

?>
<div class="row">
    <div class="col-md-12">
        <h2 class="page-title"><?= Yii::$app->name ?>网站注册条款</h2>
        <p> <?= Yii::$app->name ?>是一个为全世界从事研究和开发工作的技术人员提供服务的网站。我们希望您能够在<?= Yii::$app->name ?>
            上交流、分享、学习、进步。您需要仔细阅读并接受本协议的所有条款，才可以注册成为本网站的会员。</p>
        <h3><b>一、服务条款的确认和接受</b></h3>
        <br/>
        <p><?= Yii::$app->name ?>的各项服务的所有权和运作权归本公司所有。 <?= Yii::$app->name ?>提供的服务将完全按照其发布的章程、服务条款和操作规则严格执行。
            会员必须完全同意所有服务条款并完成注册程序，才能成为<?= Yii::$app->name ?>的正式注册会员并享受<?= Yii::$app->name ?>提供的更全面的服务。</p>
        <h3><b>二、<?= Yii::$app->name ?>网站的权利及义务</b></h3>
        <br/>
        <ol>
            <li>尊重并保护会员的隐私安全，是<?= Yii::$app->name ?>的一项基本政策。<?= Yii::$app->name ?>不会公开、编辑或透露会员的注册资料，除非符合以下情况：</li>
            <ol type="a">
                <li>根据中华人民共和国国家安全机构、公安部门的要求及根据相应的法律程序要求。</li>
                <li>维护<?= Yii::$app->name ?>的名誉权、商标所有权及其它有关权益。</li>
                <li>严重违反<?= Yii::$app->name ?>有关规定，或被其他用户投诉并经查实。</li>
            </ol>
            <li>维护<?= Yii::$app->name ?>网站的正常工作，提供网站各项服务。</li>
            <li>根据国家法律、地方法令、国际法律及国际惯例，对会员进行管理和服务。</li>
            <li>如果发生版权纠纷，<?= Yii::$app->name ?>有权在纠纷解决前删除有纠纷的视频。</li>
            <li><?= Yii::$app->name ?>对任何直接、间接、偶然、特殊及继起的损害不负法律责任，这些损害可能来自：他人的行为、会员间文件的交流、在网上进行交易，非法使用网络服务或用户传送的信息有所变动。
                这些行为都有可能会导致<?= Yii::$app->name ?>的形象受损，所以<?= Yii::$app->name ?>事先提出这种损害的可能性。
            </li>
            <li><?= Yii::$app->name ?>有责任对上传的视频进行初步的审核</li>
            <li>转载<?= Yii::$app->name ?>的视频必须得到该视频作者或者<?= Yii::$app->name ?>的授权</li>
        </ol>
        <h3><b>三、会员的权利及义务</b></h3>
        <br/>
        <ol>
            <li>会员必须严格遵守国家关于互联网管理和使用的各项法规，遵守<?= Yii::$app->name ?>的各项管理规定</li>
            <li>不在<?= Yii::$app->name ?>上上传和共享任何非法的视频，不造谣、传谣。</li>
            <li>如遇矛盾纠纷，各方需配合<?= Yii::$app->name ?>工作人员进行相关调解工作，调解不成，可诉诸法律解决。</li>
            <li>会员有义务提供完整、真实的注册资料，如果因会员注册资料不完整或不真实而给会员造成的损失，由会员自己承担，与<?= Yii::$app->name ?>无关。</li>
            <li>会员对自己的帐号和密码的安全负全部责任。会员不得用自己的账号做任何非法事情。不得借与他人使用，否则，任何相关责任，都将由账号所有人承担。</li>
            <li>会员对自己上传的视频拥有版权。</li>
        </ol>
        <h3><b>四、服务条款的修改和服务修订</b></h3>
        <br/>
        <p><?= Yii::$app->name ?>有权在必要时修改服务条款，<?= Yii::$app->name ?>服务条款一旦发生变动，将会在重要页面上提示修改内容。
            如果不同意所改动的内容，会员可以联系客服讨论、投诉或者申请取消会员身份，但是在修正前必须执行现行的服务条款。 <?= Yii::$app->name ?>
            保留随时修改或中断服务而无需告知用户的权利。<?= Yii::$app->name ?>行使修改或中断服务的权利，无需对用户或第三方负责。</p>
        <h3><b>五、通告</b></h3>
        <br/>
        <p><?= Yii::$app->name ?>的所有通告都会使用网站页面公告或发送电子邮件的方式。 会员有责任保证注册使用的电子邮箱真实、有效，并可以接收到<?= Yii::$app->name ?>的通告。</p>
        <h3><b>六、投诉和纠纷的处理</b></h3>
        <br/>
        <p>当<?= Yii::$app->name ?>网站出现投诉和纠纷的时候， 请将投诉内容发送到 <?= Yii::$app->params['supportEmail'] ?>
            ，并在邮件标题写明事由，我们将在5个工作日内回复。</p>
        <h3><b>七、解释权</b></h3>
        <br/>
        <p>本注册条款的最终解释权归本公司所有。 如果其中有任何条款与国家的有关法律相抵触，则以国家法律的明文规定为准。</p>
    </div>
</div>